cyk579/vscode-esp32s3_testcode/esp-projects/subject3-ASR/sdkconfig.defaults
# Same car hardware as gesture-car: ESP32-S3-WROOM-2-N32R16V.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_OCT_FLASH=y
CONFIG_ESPTOOLPY_FLASHMODE_OPI=y
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_DTR=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_SPI_FLASH_OCTAL_32BIT_ADDR_ENABLE=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# 24 MiB needs larger pages to fit SPIFFS 16-bit page/object indices.
CONFIG_SPIFFS_PAGE_SIZE=1024
CONFIG_SUBJECT3_BLE_BASELINE=y
CONFIG_SUBJECT3_MUSIC=y
CONFIG_SUBJECT3_SPEAKER_GAIN=100
CONFIG_UVC_GET_CONFIG_DESC=y
CONFIG_CTRL_TRANSFER_DATA_MAX_BYTES=2048
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=3000
